src/cf/Documents/ВводПлановПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ВводПлановПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещатьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияПартнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKUНаПолках053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKUНаПолках106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеРулоновНаПолу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНашихSKU053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНашихSKU106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПланшет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоШтучный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляВОГ053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляВОГ106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельПоЭкспозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельПрироста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельСледГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Координатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотСПолки053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотСПолки106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировкаПлана</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ВводПлановПродаж/Forms/ФормаЗагрузкиДанные/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагружаемДанныеЗаГодПриИзменении(Элемент)
	НачалоПериода = НачалоГода(НачалоПериода);
КонецПроцедуры


&НаСервере
Функция ЗагрузитьДанныеНаСервере()
	
	Если пропуститьПервуюСтроку тогда
		Проверка = ТабДок.Область(2,1,2,1);
		НомерСтроки=2;
	Иначе
		Проверка = ТабДок.Область(1,1,1,1);
		НомерСтроки=1;
	КонецЕсли;
	ТаблицаДанных.Очистить();
	Пока Проверка.Текст<>"" цикл
		
		//1 - Филиал
		//2 - Бренд
		//3 - Номенклатурная группа
		//4 - Торговая точка
		//5 - Торговая точка (GUID)
		ФилиалСтрока = СокрЛП(ТабДок.Область(НомерСтроки,1,НомерСтроки,1).Текст);
		БрендСтрока = СокрЛП(ТабДок.Область(НомерСтроки,2,НомерСтроки,2).Текст);
		НоменклатурнаяГруппаСтрока = СокрЛП(ТабДок.Область(НомерСтроки,3,НомерСтроки,3).Текст);
		ТТСтрока = СокрЛП(ТабДок.Область(НомерСтроки,4,НомерСтроки,4).Текст);
		ТТИД = СокрЛП(ТабДок.Область(НомерСтроки,5,НомерСтроки,5).Текст);
		МенеджерСтрока = СокрЛП(ТабДок.Область(НомерСтроки,6,НомерСтроки,6).Текст);
		КоординаторСтрока = СокрЛП(ТабДок.Область(НомерСтроки,7,НомерСтроки,7).Текст);
		
		Если нрег(ФилиалСтрока) = "вог сибирь" или нрег(ФилиалСтрока) = "вог-сибирь" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000009");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог урал" или нрег(ФилиалСтрока) = "вог-урал" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000003");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог самара" или нрег(ФилиалСтрока) = "вог-самара" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000008");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - ростов" или нрег(ФилиалСтрока) = "вог-юг-ростов" или нрег(ФилиалСтрока) = "вог юг ростов" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("CR-000015");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - кмв" или нрег(ФилиалСтрока) = "вог-юг-кмв" или нрег(ФилиалСтрока) = "вог юг кмв" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000004");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог кубань" или нрег(ФилиалСтрока) = "вог-кубань" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000002");		
		ИначеЕсли нрег(ФилиалСтрока) = "декор-к"  тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000013");		
		ИначеЕсли нрег(ФилиалСтрока) = "тк вог" или нрег(ФилиалСтрока) = "тк-вог" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000006");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог керамика" или нрег(ФилиалСтрока) = "вог-керамика" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000001");		
		Иначе
			Филиал = Справочники.СтруктураПредприятия.ПустаяСсылка();
			Сообщить("Ошибка обработки филиала строка "+ НомерСтроки);	
		КонецЕсли;
		
		Если БрендСтрока = "Лассельсбергер" тогда
			БрендСтрока = "LBCeramics";
		КонецЕсли;                                           
		Если БрендСтрока = "Глобал Тайл" тогда
			БрендСтрока = "GlobalTile";
		КонецЕсли;                                           
		Если БрендСтрока<>"" тогда
			Бренд = Справочники.вогБренды.НайтиПоНаименованию(БрендСтрока);
		КонецЕсли;                                           
		
		
		Если Не ЗначениеЗаполнено(Бренд) тогда
			Сообщить("Ошибка обработки бренда строка "+ НомерСтроки);	
		КонецЕсли;
		
		НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НоменклатурнаяГруппаСтрока);
		Менеджер = Справочники.Пользователи.НайтиПоНаименованию(МенеджерСтрока);
		Координатор = Справочники.Пользователи.НайтиПоНаименованию(КоординаторСтрока);
		
		Если ЗначениеЗаполнено(ТТИД) тогда
			ТТ = Справочники.вогТорговыеТочки.ПолучитьСсылку(Новый УникальныйИдентификатор(ТТИД));	
			Юр = Справочники.вогЮридическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ТТИД));
			Если ЗначениеЗаполнено(ТТ.Партнер) тогда
				Партнер = ТТ.Партнер;
			ИначеЕсли ЗначениеЗаполнено(Юр.Партнер) тогда
				ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
				Партнер = Юр.Партнер;
			КонецЕсли;
		ИначеЕсли  ЗначениеЗаполнено(ТТСтрока) тогда
			ТТ = Справочники.вогТорговыеТочки.НайтиПоНаименованию(ТТСтрока,Истина);
			Партнер = Справочники.Партнеры.НайтиПоНаименованию(ТТСтрока,Истина);
			Если ЗначениеЗаполнено(Партнер) тогда
				ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
			ИначеЕсли ЗначениеЗаполнено(ТТ) тогда
				Партнер = ТТ.Партнер;
			КонецЕсли;
		Иначе
			ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
		КонецЕсли;
	
		Если ЗагружаемДанныеЗаГод тогда
			КоличествоПериодов = 12;	
		Иначе
			КоличествоПериодов = 1;	
		КонецЕсли;
		// +++ VOG Кулаков П.Л. 15.03.2021
		// Ошибка при загрузке
		//Если ЗагружаемКоличество и ЗагружаемСумму тогда
		//	КоличествоПериодов = КоличествоПериодов * 3;
		//КонецЕсли;
		// --- VOG Кулаков П.Л.
		нСтрока = ТаблицаДанных.Добавить();
		нСтрока.Филиал = Филиал;
		нСтрока.Бренд = Бренд;
		нСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
		нСтрока.ТТ = ТТ;
		нСтрока.Бренд = Бренд;
		нСтрока.НачалоПериода = НачалоПериода;
		нСтрока.ДанныеЗаОдинПериод = НЕ ЗагружаемДанныеЗаГод;
		нСтрока.Партнер = Партнер;
		нСтрока.Менеджер = Менеджер;
		нСтрока.Координатор = Координатор;
		Если ЗначениеЗаполнено(нСтрока.менеджер) и Не ЗначениеЗаполнено(нСтрока.Филиал) тогда
			нСтрока.Филиал = вогОбщегоНазначения.ПолучитьФилиалПользователя(нСтрока.Менеджер);
		КонецЕсли;
		
		Счетчик = 1;
		Для НомерПериода = 1 по КоличествоПериодов  цикл
			Ошибка = Ложь;
			Если ЗагружаемКоличество и ЗагружаемСумму тогда
				Попытка
					ДанныеК = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+Счетчик,НомерСтроки,7+Счетчик).Текст),",",".")," ",""));
					ДанныеС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,8+Счетчик,НомерСтроки,8+Счетчик).Текст),",",".")," ",""));
					ДанныеНДС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,9+Счетчик,НомерСтроки,9+Счетчик).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Количество"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеК;	
				нСтрока["Сумма"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеС;
				нСтрока["НДС"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеНДС;	
				Счетчик = Счетчик+3;
			ИначеЕсли ЗагружаемКоличество тогда 
				Попытка
					ДанныеК = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+НомерПериода,НомерСтроки,7+НомерПериода).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Количество"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеК;	
			ИНачеЕсли ЗагружаемСумму тогда
				Попытка
					ДанныеС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+Счетчик,НомерСтроки,7+Счетчик).Текст),",",".")," ",""));
					ДанныеНДС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,8+Счетчик,НомерСтроки,8+Счетчик).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Сумма"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеС;	
				нСтрока["НДС"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеНДС;	
				Счетчик = Счетчик+2;
			КонецЕслИ;
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		Проверка = ТабДок.Область(НомерСтроки,1,НомерСтроки,1);
	КонецЦикла;
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДанных.Выгрузить(),Новый УникальныйИдентификатор);
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	АдресХ = ЗагрузитьДанныеНаСервере();
	Закрыть(АдресХ);
	
КонецПроцедуры
